Autodesk.Revit.DB.Events.DocumentOpenProgessChangedEventArgs.DocumentOpenFinished
Indicates if current document opening progress is finished or not.
Since:
2017 Subscription Update

Autodesk.Revit.DB.Events.DocumentOpenProgessChangedEventArgs.DownloadFinished
Indicates if all data downloads are finished or not.
Remarks:
It would make no sense if openWithoutDownload is true.
Since:
2017 Subscription Update

Autodesk.Revit.DB.Events.DocumentOpenProgessChangedEventArgs.FullDownload
Indicates if download the full data of the document, which will take longer than subsequent downloads.
Remarks:
It would make no sense if openWithoutDownload is true.
Since:
2017 Subscription Update

Autodesk.Revit.DB.Events.DocumentOpenProgessChangedEventArgs.OpenWithoutDownload
Indicates if it is opened directly but without download step.
Since:
2017 Subscription Update

Autodesk.Revit.DB.Events.DocumentOpenProgessChangedEventArgs.#ctor(Autodesk.Revit.DB.Events.DocumentOpenProgessChangedEventArgs)
Creates a copy of the DocumentOpenProgessChangedEventArgs.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017 Subscription Update

Autodesk.Revit.DB.Events.DocumentOpenProgessChangedEventArgs
The event arguments used during the document open phase of the WorksharedOperationProgressChanged event.
Remarks:
The location and related parameters will be changed when opening a Revit document with Revit link.
It is NOT recommended to do any time-consuming work when handling WorksharedOperationProgressChanged event. This can increase workshared operation time.
Since:
2017 Subscription Update